---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.Append(Autodesk.Revit.DB.SlabShapeCrease)
source: html/33350d56-7c1e-732d-9ca4-0d7db1850bed.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.Append Method

Add the item to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	SlabShapeCrease item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SlabShapeCrease`) - The item to be added.